/***********************************************************************
压缩图像到jpeg格式
如果压缩前图像为灰度图或24位图，压缩后图像色彩模式不变
如果压缩前图像为256色索引位图，压缩后变为灰度图
************************************************************************/

void bmp2jpg(char *src,int sSize, char *des,int *dSize, int qual);

#define bmp2jpg60(a,b,c,d) bmp2jpg((a),(b),(c),(d),60)

/***********************************************
*解压缩jpeg到bmp格式
*对于灰度图和24位图，图像解压后正常
*对于256色索引位图，图像解压后为灰度图
**************************************************/

void jpg2bmp(char *src,int sSize, char *des,int *dSize);